## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-06-30T21:41:43.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:11/invocations" -> (known after apply)
      ~ s3_key                         = "builds/0564f849439c7e5f216c41120c50b71967cb8315fdd135879ff52ca3841d258a.zip" -> "builds/463167fa1189a022d0b280486dba72d450e8a174367300db001ea1e2830312c8.zip"
      ~ s3_object_version              = "iapLwqDpasWPVrB6wKEIVf2lnzPJNrJF" -> (known after apply)
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:a986442b23ac6848265685b34f087e7278a29529,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:1587126d3c65c2e7f8ff35ce1aa5c69eed99f283,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "a986442b23ac6848265685b34f087e7278a29529" -> "1587126d3c65c2e7f8ff35ce1aa5c69eed99f283"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "11" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b6cf79537f7619d4282dd9eec30adf2a-2" -> (known after apply)
      ~ id                     = "builds/0564f849439c7e5f216c41120c50b71967cb8315fdd135879ff52ca3841d258a.zip" -> (known after apply)
      ~ key                    = "builds/0564f849439c7e5f216c41120c50b71967cb8315fdd135879ff52ca3841d258a.zip" -> "builds/463167fa1189a022d0b280486dba72d450e8a174367300db001ea1e2830312c8.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/0564f849439c7e5f216c41120c50b71967cb8315fdd135879ff52ca3841d258a.zip" -> "builds/463167fa1189a022d0b280486dba72d450e8a174367300db001ea1e2830312c8.zip"
-       tags                   = {} -> null
      ~ version_id             = "iapLwqDpasWPVrB6wKEIVf2lnzPJNrJF" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/463167fa1189a022d0b280486dba72d450e8a174367300db001ea1e2830312c8.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/463167fa1189a022d0b280486dba72d450e8a174367300db001ea1e2830312c8.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5209164717489062696" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0564f849439c7e5f216c41120c50b71967cb8315fdd135879ff52ca3841d258a.zip" -> "builds/463167fa1189a022d0b280486dba72d450e8a174367300db001ea1e2830312c8.zip"
          ~ "timestamp" = "1688161270938585000" -> "1688161422025798000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3974445212938108416" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/0564f849439c7e5f216c41120c50b71967cb8315fdd135879ff52ca3841d258a.zip" -> "builds/463167fa1189a022d0b280486dba72d450e8a174367300db001ea1e2830312c8.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-06-30T21:41:43.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:36" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:36/invocations" -> (known after apply)
      ~ s3_key                         = "builds/eda1d67b073be296d2840d8d55ea7f07a92dc86b6debb3a94ede0b05e136ee9b.zip" -> "builds/735f00abec9af17cbbfbb93ad08e80c0948a1e18aa541eca735c75864cdfca3a.zip"
      ~ s3_object_version              = "R8XE7u.ArlhR3pi2R3xtUKbyc2_JgS4V" -> (known after apply)
        tags                           = {}
      ~ version                        = "36" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:a986442b23ac6848265685b34f087e7278a29529,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:1587126d3c65c2e7f8ff35ce1aa5c69eed99f283,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "a986442b23ac6848265685b34f087e7278a29529" -> "1587126d3c65c2e7f8ff35ce1aa5c69eed99f283"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "36" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "450b908bb2c3cb330998569893e830d0-2" -> (known after apply)
      ~ id                     = "builds/eda1d67b073be296d2840d8d55ea7f07a92dc86b6debb3a94ede0b05e136ee9b.zip" -> (known after apply)
      ~ key                    = "builds/eda1d67b073be296d2840d8d55ea7f07a92dc86b6debb3a94ede0b05e136ee9b.zip" -> "builds/735f00abec9af17cbbfbb93ad08e80c0948a1e18aa541eca735c75864cdfca3a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/eda1d67b073be296d2840d8d55ea7f07a92dc86b6debb3a94ede0b05e136ee9b.zip" -> "builds/735f00abec9af17cbbfbb93ad08e80c0948a1e18aa541eca735c75864cdfca3a.zip"
-       tags                   = {} -> null
      ~ version_id             = "R8XE7u.ArlhR3pi2R3xtUKbyc2_JgS4V" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/735f00abec9af17cbbfbb93ad08e80c0948a1e18aa541eca735c75864cdfca3a.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/735f00abec9af17cbbfbb93ad08e80c0948a1e18aa541eca735c75864cdfca3a.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5238867429315135108" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/eda1d67b073be296d2840d8d55ea7f07a92dc86b6debb3a94ede0b05e136ee9b.zip" -> "builds/735f00abec9af17cbbfbb93ad08e80c0948a1e18aa541eca735c75864cdfca3a.zip"
          ~ "timestamp" = "1688161251773583000" -> "1688161401486867000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "2306610930779664420" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/eda1d67b073be296d2840d8d55ea7f07a92dc86b6debb3a94ede0b05e136ee9b.zip" -> "builds/735f00abec9af17cbbfbb93ad08e80c0948a1e18aa541eca735c75864cdfca3a.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-06-30T21:41:43.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:16/invocations" -> (known after apply)
      ~ s3_key                         = "builds/377abeaec29c769689f4510f660e6ee4da48a9e03bda82b01af5f629a30ca3a6.zip" -> "builds/48b77d34028368c844ac02e5e1f62012e17a945632ceb487c82424673fc06b6d.zip"
      ~ s3_object_version              = "UDUSMcgNQi._8Yz1Ti0TgDw1wcRV3CY9" -> (known after apply)
        tags                           = {}
      ~ version                        = "16" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:a986442b23ac6848265685b34f087e7278a29529,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:1587126d3c65c2e7f8ff35ce1aa5c69eed99f283,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "a986442b23ac6848265685b34f087e7278a29529" -> "1587126d3c65c2e7f8ff35ce1aa5c69eed99f283"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "16" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2b80f92c7dc5bf28860582ebedb586e3-2" -> (known after apply)
      ~ id                     = "builds/377abeaec29c769689f4510f660e6ee4da48a9e03bda82b01af5f629a30ca3a6.zip" -> (known after apply)
      ~ key                    = "builds/377abeaec29c769689f4510f660e6ee4da48a9e03bda82b01af5f629a30ca3a6.zip" -> "builds/48b77d34028368c844ac02e5e1f62012e17a945632ceb487c82424673fc06b6d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/377abeaec29c769689f4510f660e6ee4da48a9e03bda82b01af5f629a30ca3a6.zip" -> "builds/48b77d34028368c844ac02e5e1f62012e17a945632ceb487c82424673fc06b6d.zip"
-       tags                   = {} -> null
      ~ version_id             = "UDUSMcgNQi._8Yz1Ti0TgDw1wcRV3CY9" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/48b77d34028368c844ac02e5e1f62012e17a945632ceb487c82424673fc06b6d.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/48b77d34028368c844ac02e5e1f62012e17a945632ceb487c82424673fc06b6d.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1427242611237373613" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/377abeaec29c769689f4510f660e6ee4da48a9e03bda82b01af5f629a30ca3a6.zip" -> "builds/48b77d34028368c844ac02e5e1f62012e17a945632ceb487c82424673fc06b6d.zip"
          ~ "timestamp" = "1688161270655105200" -> "1688161421895531800"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "2057261800013455629" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/377abeaec29c769689f4510f660e6ee4da48a9e03bda82b01af5f629a30ca3a6.zip" -> "builds/48b77d34028368c844ac02e5e1f62012e17a945632ceb487c82424673fc06b6d.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-06-30T21:41:43.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:5/invocations" -> (known after apply)
      ~ s3_key                         = "builds/b46c8a94b4b60e9f75c645a5a629437b4aa99b55013829077aa8da4acebcca20.zip" -> "builds/d253fa4dffd30c86b6a3869c3dd4e4ace3622db84aa9021b7090ca5eec3e92f7.zip"
      ~ s3_object_version              = "RJ8F7vZVXW2kkDdXjqkvzHMtEo0vBFPh" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:a986442b23ac6848265685b34f087e7278a29529,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:1587126d3c65c2e7f8ff35ce1aa5c69eed99f283,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "a986442b23ac6848265685b34f087e7278a29529" -> "1587126d3c65c2e7f8ff35ce1aa5c69eed99f283"
                # (11 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "5" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "8df2f1b50e318e7ba2cf3da2cabed9cd-2" -> (known after apply)
      ~ id                     = "builds/b46c8a94b4b60e9f75c645a5a629437b4aa99b55013829077aa8da4acebcca20.zip" -> (known after apply)
      ~ key                    = "builds/b46c8a94b4b60e9f75c645a5a629437b4aa99b55013829077aa8da4acebcca20.zip" -> "builds/d253fa4dffd30c86b6a3869c3dd4e4ace3622db84aa9021b7090ca5eec3e92f7.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/b46c8a94b4b60e9f75c645a5a629437b4aa99b55013829077aa8da4acebcca20.zip" -> "builds/d253fa4dffd30c86b6a3869c3dd4e4ace3622db84aa9021b7090ca5eec3e92f7.zip"
-       tags                   = {} -> null
      ~ version_id             = "RJ8F7vZVXW2kkDdXjqkvzHMtEo0vBFPh" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ExtractGrantsGovDBToXML
                            cd bin/ExtractGrantsGovDBToXML
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/d253fa4dffd30c86b6a3869c3dd4e4ace3622db84aa9021b7090ca5eec3e92f7.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/d253fa4dffd30c86b6a3869c3dd4e4ace3622db84aa9021b7090ca5eec3e92f7.plan.json"
+       id                   = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5224452312473422432" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b46c8a94b4b60e9f75c645a5a629437b4aa99b55013829077aa8da4acebcca20.zip" -> "builds/d253fa4dffd30c86b6a3869c3dd4e4ace3622db84aa9021b7090ca5eec3e92f7.zip"
          ~ "timestamp" = "1688161271155073000" -> "1688161422196038000"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "878733212960322278" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/b46c8a94b4b60e9f75c645a5a629437b4aa99b55013829077aa8da4acebcca20.zip" -> "builds/d253fa4dffd30c86b6a3869c3dd4e4ace3622db84aa9021b7090ca5eec3e92f7.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-06-30T21:41:43.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:6/invocations" -> (known after apply)
      ~ s3_key                         = "builds/99991ac81826e37a39b537a5e91893e72e0d5048c8fda524bf5e75e9821b598c.zip" -> "builds/1e883bc104c5abed6a8a62203b156806524fe2694c4cc8a6a229120ae015c2da.zip"
      ~ s3_object_version              = "VKsWT.x1pWsBnlN_XevBu2p5xj9kj8Sw" -> (known after apply)
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:a986442b23ac6848265685b34f087e7278a29529,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:1587126d3c65c2e7f8ff35ce1aa5c69eed99f283,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "a986442b23ac6848265685b34f087e7278a29529" -> "1587126d3c65c2e7f8ff35ce1aa5c69eed99f283"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e882a3f92606a94841e66b45f79159db-2" -> (known after apply)
      ~ id                     = "builds/99991ac81826e37a39b537a5e91893e72e0d5048c8fda524bf5e75e9821b598c.zip" -> (known after apply)
      ~ key                    = "builds/99991ac81826e37a39b537a5e91893e72e0d5048c8fda524bf5e75e9821b598c.zip" -> "builds/1e883bc104c5abed6a8a62203b156806524fe2694c4cc8a6a229120ae015c2da.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/99991ac81826e37a39b537a5e91893e72e0d5048c8fda524bf5e75e9821b598c.zip" -> "builds/1e883bc104c5abed6a8a62203b156806524fe2694c4cc8a6a229120ae015c2da.zip"
-       tags                   = {} -> null
      ~ version_id             = "VKsWT.x1pWsBnlN_XevBu2p5xj9kj8Sw" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistFFISData
                            cd bin/PersistFFISData
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/1e883bc104c5abed6a8a62203b156806524fe2694c4cc8a6a229120ae015c2da.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/1e883bc104c5abed6a8a62203b156806524fe2694c4cc8a6a229120ae015c2da.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8452941500182817605" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/99991ac81826e37a39b537a5e91893e72e0d5048c8fda524bf5e75e9821b598c.zip" -> "builds/1e883bc104c5abed6a8a62203b156806524fe2694c4cc8a6a229120ae015c2da.zip"
          ~ "timestamp" = "1688161270517010000" -> "1688161422155155000"
        }
    }

  # module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7376370735245426621" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/99991ac81826e37a39b537a5e91893e72e0d5048c8fda524bf5e75e9821b598c.zip" -> "builds/1e883bc104c5abed6a8a62203b156806524fe2694c4cc8a6a229120ae015c2da.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-30T21:41:42.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:8/invocations" -> (known after apply)
      ~ s3_key                         = "builds/4cbc40c041666222a7c217345d59289133f8ca8a13c27e03b3c276f7e7a458ed.zip" -> "builds/c4eb518a8626d568047423028afba24ebe25d7e25cd0175bf58d5d64bb57ec2d.zip"
      ~ s3_object_version              = "caMD2rXkeKqFTwqlYy07QY.OqU719McE" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:a986442b23ac6848265685b34f087e7278a29529,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:1587126d3c65c2e7f8ff35ce1aa5c69eed99f283,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "a986442b23ac6848265685b34f087e7278a29529" -> "1587126d3c65c2e7f8ff35ce1aa5c69eed99f283"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "8" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "7084753298410f9524d2c98f81188baf-2" -> (known after apply)
      ~ id                     = "builds/4cbc40c041666222a7c217345d59289133f8ca8a13c27e03b3c276f7e7a458ed.zip" -> (known after apply)
      ~ key                    = "builds/4cbc40c041666222a7c217345d59289133f8ca8a13c27e03b3c276f7e7a458ed.zip" -> "builds/c4eb518a8626d568047423028afba24ebe25d7e25cd0175bf58d5d64bb57ec2d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/4cbc40c041666222a7c217345d59289133f8ca8a13c27e03b3c276f7e7a458ed.zip" -> "builds/c4eb518a8626d568047423028afba24ebe25d7e25cd0175bf58d5d64bb57ec2d.zip"
-       tags                   = {} -> null
      ~ version_id             = "caMD2rXkeKqFTwqlYy07QY.OqU719McE" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/c4eb518a8626d568047423028afba24ebe25d7e25cd0175bf58d5d64bb57ec2d.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/c4eb518a8626d568047423028afba24ebe25d7e25cd0175bf58d5d64bb57ec2d.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3779928555819299988" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4cbc40c041666222a7c217345d59289133f8ca8a13c27e03b3c276f7e7a458ed.zip" -> "builds/c4eb518a8626d568047423028afba24ebe25d7e25cd0175bf58d5d64bb57ec2d.zip"
          ~ "timestamp" = "1688161251887926200" -> "1688161401889672000"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5079453312501083987" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/4cbc40c041666222a7c217345d59289133f8ca8a13c27e03b3c276f7e7a458ed.zip" -> "builds/c4eb518a8626d568047423028afba24ebe25d7e25cd0175bf58d5d64bb57ec2d.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-06-30T21:41:43.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:7/invocations" -> (known after apply)
      ~ s3_key                         = "builds/a400e0a5ae2da21aa34709224e1c10a4f03f10d4bad21649cdbaf9a4f2cad7b0.zip" -> "builds/cf21321369499776ebb34da44c59ebb9ef09edfa62f10833c235a8d9233541e4.zip"
      ~ s3_object_version              = "_B_pxtubGcfam2pOPg.jpvhosSXAFPX_" -> (known after apply)
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:a986442b23ac6848265685b34f087e7278a29529,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:1587126d3c65c2e7f8ff35ce1aa5c69eed99f283,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "a986442b23ac6848265685b34f087e7278a29529" -> "1587126d3c65c2e7f8ff35ce1aa5c69eed99f283"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "7" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fb5aa03a7e4297b606f102332b9a4718-2" -> (known after apply)
      ~ id                     = "builds/a400e0a5ae2da21aa34709224e1c10a4f03f10d4bad21649cdbaf9a4f2cad7b0.zip" -> (known after apply)
      ~ key                    = "builds/a400e0a5ae2da21aa34709224e1c10a4f03f10d4bad21649cdbaf9a4f2cad7b0.zip" -> "builds/cf21321369499776ebb34da44c59ebb9ef09edfa62f10833c235a8d9233541e4.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/a400e0a5ae2da21aa34709224e1c10a4f03f10d4bad21649cdbaf9a4f2cad7b0.zip" -> "builds/cf21321369499776ebb34da44c59ebb9ef09edfa62f10833c235a8d9233541e4.zip"
-       tags                   = {} -> null
      ~ version_id             = "_B_pxtubGcfam2pOPg.jpvhosSXAFPX_" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitFFISSpreadsheet
                            cd bin/SplitFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/cf21321369499776ebb34da44c59ebb9ef09edfa62f10833c235a8d9233541e4.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/cf21321369499776ebb34da44c59ebb9ef09edfa62f10833c235a8d9233541e4.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8434521037893616105" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a400e0a5ae2da21aa34709224e1c10a4f03f10d4bad21649cdbaf9a4f2cad7b0.zip" -> "builds/cf21321369499776ebb34da44c59ebb9ef09edfa62f10833c235a8d9233541e4.zip"
          ~ "timestamp" = "1688161271015012000" -> "1688161421921834000"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "2780058233688144940" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/a400e0a5ae2da21aa34709224e1c10a4f03f10d4bad21649cdbaf9a4f2cad7b0.zip" -> "builds/cf21321369499776ebb34da44c59ebb9ef09edfa62f10833c235a8d9233541e4.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-30T21:41:43.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:35" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:35/invocations" -> (known after apply)
      ~ s3_key                         = "builds/6c8204c7ec88dab7574ea603736bba1f347d3a79a1ebfd847094ff481d3481a2.zip" -> "builds/1968f42e6c1ffe3feb0ea6704757c5b725b8986bc9d8981c747eb9db3fbd1066.zip"
      ~ s3_object_version              = ".jPwO5tX0RPbZ90KkSHnkqnkESc63QCd" -> (known after apply)
        tags                           = {}
      ~ version                        = "35" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:a986442b23ac6848265685b34f087e7278a29529,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:1587126d3c65c2e7f8ff35ce1aa5c69eed99f283,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "a986442b23ac6848265685b34f087e7278a29529" -> "1587126d3c65c2e7f8ff35ce1aa5c69eed99f283"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "35" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "36c4561bf8134bfe7cea57407ba9df05-2" -> (known after apply)
      ~ id                     = "builds/6c8204c7ec88dab7574ea603736bba1f347d3a79a1ebfd847094ff481d3481a2.zip" -> (known after apply)
      ~ key                    = "builds/6c8204c7ec88dab7574ea603736bba1f347d3a79a1ebfd847094ff481d3481a2.zip" -> "builds/1968f42e6c1ffe3feb0ea6704757c5b725b8986bc9d8981c747eb9db3fbd1066.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/6c8204c7ec88dab7574ea603736bba1f347d3a79a1ebfd847094ff481d3481a2.zip" -> "builds/1968f42e6c1ffe3feb0ea6704757c5b725b8986bc9d8981c747eb9db3fbd1066.zip"
-       tags                   = {} -> null
      ~ version_id             = ".jPwO5tX0RPbZ90KkSHnkqnkESc63QCd" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/1968f42e6c1ffe3feb0ea6704757c5b725b8986bc9d8981c747eb9db3fbd1066.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/1968f42e6c1ffe3feb0ea6704757c5b725b8986bc9d8981c747eb9db3fbd1066.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1011265965233450123" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/6c8204c7ec88dab7574ea603736bba1f347d3a79a1ebfd847094ff481d3481a2.zip" -> "builds/1968f42e6c1ffe3feb0ea6704757c5b725b8986bc9d8981c747eb9db3fbd1066.zip"
          ~ "timestamp" = "1688161251722629000" -> "1688161401962818000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3154226270304243159" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/6c8204c7ec88dab7574ea603736bba1f347d3a79a1ebfd847094ff481d3481a2.zip" -> "builds/1968f42e6c1ffe3feb0ea6704757c5b725b8986bc9d8981c747eb9db3fbd1066.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 40 to add, 13 to change, 32 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5427204232)*